/*==================================================================================================================
  *【文件名称】  main.c
  *【编写人员】  魔女开发板团队
  *【淘    宝】  魔女开发板  https://demoboard.taobao.com
 ===================================================================================================================
 **【实验名称】  触摸屏测试-XPT2046
 **
 **【实验平台】  STM32F103 + KEIL5.27 + 2.8寸显示屏(ILI9341驱动芯片) + 触摸屏(XPT2046)
 **
 **【实验操作】  硬件接线：
 **              1_显示屏接线：无需另外接线，直接压入排母中即可;
 **              1_触摸面板，无需另外接线，线路已焊接在显示屏排针上，把屏直接压入排母中即可;
 **
 **              测试现象：
 **              1：打开电脑的串口软件，并打开相应的串口;
 **              2：烧录代码后，可在显示屏上，显示相关的板子初始化信息;
 **              3：用指甲在屏面上按压，或拉划，会画点黄色的按压轨迹;
 **         
 **【重点重点】  1：电阻屏，电阻屏，电阻屏，嵌入式开发产品中的触摸屏，大部分都采用电阻屏，而非手机那种电容屏。
 **              
 **              
 **
 **
 **【更新记录】  2021-05-12  创建；
 **
 **【备注说明】  版权归魔女科技所有，请勿商用，谢谢！
 **              https://demoboard.taobao.com
===================================================================================================================*/#include <stm32f10x.h>
#include "stm32f10x_conf.h"                           // 头文件引用(标准库); 内核、芯片外设....；(stm32f10x.conf.h, 对标准库头文件进行调用)  
#include "hardware.h"                                 // 头文件引用(用户的); 设备、传感器......;



// 主函数
int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);   // 中断分组，组2:抢占级0~3,子优先级0~3 ; 全局只设置一次，尽量放在显眼的地方

    Hardware_Init();

    while (1)                                         // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    {
        Scheduler_Run();                              // 任务轮询; 所有状态任务, 均放这个函数里, 不断间隔执行
    }
}




