/**==================================================================================================================
 **【文件名称】  main.c
 **【功能测试】  BH1750-光强度传感器数据采集
 **==================================================================================================================
 **【实验平台】  STM32F103 + KEIL5.27 + BH1750
 **
 **【实验操作】  1-模块接线，VCC  接  3.3V
 **                          GND  接  GND
 **                          SCL  接  PB1
 **                          SDA  接  PB0
 **                          ADDR 接  空置或GND
 **              2-烧录代码至开发板，并重新上电或复位，使新程序运行；
 **              3-打开电脑串口上位机，115200-N-8-1, 即可观察到采集的数据；
 **              4-注意：DHT11的上电稳定时间约:180mS，数据更新时长约: 120mS以上;
 **
 **
 **【文件移植】  步骤1-复制文件：可复制bsp_BH1750.c和bsp_BH1750.h两个文件，或复制BH1750文件夹，保存到所需工程目录文件夹下；
 **              步骤2-添加文件：在keil工各程左侧文件管理器中，双击某文件夹，以添加bsp_BH1750.c文件;
 **              步骤3-添加路径：点击魔术棒工具按钮，在“c/c++"选项页中，点击”Include Path"后面的按键，以添加文件存放所在路径(是文件夹，不是文件);
 **　　　　　    步骤4-添加引脚：在所需DHT11功能的代码文件头部，添加：#include "bsp_BH1750.h";
 **
 **
 **【函数使用】  初始化：  BH1750_Init( );       // 初始化BH1750的IIC引脚; 注意：本代码采用软件IIC，引脚在bsp_BH1750.h中修改
 **              获取数据：BH1750_GetData( );    // 获取BH1750的光度值; 注意: 返回float类型数据
 **
 **
 **【备注说明】  代码版权归魔女科技所有，请勿商用，谢谢！
 **              https://demoboard.taobao.com
====================================================================================================================*/
#include <stm32f10x.h>            // 头文件引用(标准库); 内核、芯片外设....；(stm32f10x.conf.h, 对标准库头文件进行调用)     
#include "stm32f10x_conf.h"       // 头文件引用(标准库); 内核、芯片外设....；(stm32f10x.conf.h, 对标准库头文件进行调用) 
#include "bsp_led.h"              // LED指示灯
#include "bsp_usart.h"            // USART1、2、3，UART4、5
#include "bsp_lcd_ili9341.h"      // 2.8寸显示屏  
#include "bsp_w25Qxx.h"           // 外部FLASH，用于中文支持
#include "bsp_BH1750.h"           // 光照度模块-BH1750



float light = 0.0;                // 用于存储存储光照度值
char   strTem[100];               // 用于临时存储字符串



// ms延时函数，减少移植时对外部文件依赖；
static void delay_ms(uint32_t ms)
{
    ms = ms * 6500;
    for (uint32_t i = 0; i < ms; i++); // 72MHz系统时钟下，多少个空循环约耗时1ms
}



// 主函数
int main(void)
{
    USART1_Init(115200);                                        // 串口初始化：USART1(115200-N-8-1), 且工程已把printf重定向至USART1输出

    Led_Init();                                                 // LED 初始化
    LED_RED_ON;                                                 // 点亮红灯

    W25qx_Init();                                               // 初始化外部Flash, 已烧录有中文字库

    LCD_Init();                                                 // 初始化LCD-2.8寸屏-驱动芯片ILI9341
    LCD_String(20, 8, "BH1750光强度传感器", 24, WHITE, BLACK);  // 预先显示固定的屏显内容，不用重复刷新占用芯片资源
    LCD_Line(0, 40, 239, 40, WHITE);
    LCD_String(5, 65, "当前光强度值：", 16, WHITE, BLACK);

    BH1750_Init();                                              // 初始化BH1750所用IIC引脚; 注意：本代码采用软件IIC，引脚在bsp_BH1750.h中修改

    while (1)                                                   // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    {
        delay_ms(500);                                          // 延时500ms
        LED_RED_TOGGLE;                                         // 红色LED，间隔亮灭，以判断系统正常工作

        light = BH1750_GetData();                               // 读取BH1750的光强度数据
        printf("BH1750  光强度:%4.1f\r\n", light);              // 把数据输出到电脑串口软件，方便观察

        sprintf(strTem, "%4.1f    ", light);                    // 格式化，把float值存储为字符数组
        LCD_String(130, 65, strTem, 16, GREEN, BLACK);          // 温度值显示在显示屏上
    }
}




// 注意：每个代码文件的末尾，要保留一个空行
