/**==================================================================================================================
 **【文件名称】  main.c
 **【功    能】  ADC获取外部电压
 ===================================================================================================================
 **
 **【划 重 点】 危险：绝对不要采集超过Vref或VDDA引脚电压的外部电压(即，不要超过3.3V)
 **             易错: 对外部供电电路采集时，要共地;
 **             易错: 当采集引脚悬空时，将采集到约为2000左右的跳动值；估计处在悬空时，引脚内部两个钳位二极管存在微弱的漏电流，导致IO口电压约等于供电电压的一半；
 **
 **
 **【操作说明】 1-运行代码后，可以串口上位机中，观察到此时芯片的温度;
 **
 **【文件移植】 1：复制bsp文件夹下的ADC文件夹，粘贴到相应的工程文件夹里。ADC文件夹内有两个文件：bsp_adc.c、bsp_adc.h；
 **             2：在keil左侧工程文件管理器Project中，双击某文件夹，以添加文件bsp_adc.c
 **             3: 在keil里添加路径：魔术棒->c/c++->include path...增加(刚才粘贴文件夹的位置)；
 **
 **【代码使用】 1：在要使用ADC功能的文件中，添加：#include “bsp_adc.h";
 **             2: 调用 ADC1_GetInteriorTemperature()函数，即可返回float类型的摄氏度值;
 **
 **
 **【更    新】 2022-01-27  完善示例格式
 **
 **【备注说明】 版权归魔女科技所有，请勿商用，谢谢！
 **             https://demoboard.taobao.com
===================================================================================================================*/
#include "system_f103.h"                               // 调用system_f103.h以简化代码工作
#include "bsp_usart.h"
#include "bsp_led.h"
#include "bsp_adc.h"



float  Temperature = 0.0;



static void delay_ms(uint32_t ms)                       // 定义一个ms延时函数，减少移植时对外部文件依赖;
{
    ms = ms * 6500;
    for (uint32_t i = 0; i < ms; i++);                  // 72MHz系统时钟下，大约6500个空循环耗时1ms
}



int main(void)
{
    USART1_Init(115200);                                // 串口初始化：USART1(115200-N-8-1), 且工程已把printf重定向至USART1输出

    Led_Init();                                         // LED 初始化
    LED_BLUE_ON ;
    LED_RED_ON ;

    while (1)                                           // 死循环，不能让main函数运行结束，否则会产生硬件错误
    {
        delay_ms(500);                                  // 上面已初始化SysTick, 其后就可以直接使用System_DelayMS()、System_DelayMS()
        LED_RED_TOGGLE;                                 // 规律闪烁红色LED，以方便观察系统是否正常工作

        Temperature = ADC1_GetInteriorTemperature();    // 获取内部电压
        printf("\r芯片内部温度：%3.1f℃\r", Temperature);
    }
}

