/*==================================================================================================================
 *【文件名称】  main.c
 *【功    能】  发货前综合测试实现
 ===================================================================================================================
 *【操作说明】
 * 本工程文件，适合魔女开发板F103系列；
 *
 *【更    新】
 * 2021-12-01  统一bsp文件夹文件名称
 * 2021-11-30  增加CAN、RS485代码对测试器的支持
 * 2020-12-18  完善代码结构、完善注释格式
 *
 *【备注说明】
 * 版权归魔女科技所有，请勿商用，谢谢！
 * https://demoboard.taobao.com
===================================================================================================================*/
#include "stm32f10x.h"                                // 芯片支持文件
#include "hardware.h"                                 // 头文件引用(用户的); 设备、传感器......;



// 主函数
int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);   // 中断分组，组2:抢占级0~3,子优先级0~3 ; 全局只设置一次，尽量放在显眼的地方

    Hardware_Init();

    while (1)                                         // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    {
        Scheduler_Run();                              // 任务轮询; 所有状态任务, 均放这个函数里, 不断间隔执行
    }
}




