/**==================================================================================================================
 **【文件名称】  main.c
 **【功能测试】  按键控制LED_使用扫描方法检测按键状态
 **==================================================================================================================
 **【实验平台】  STM32F103 + KEIL5.27 
 **
 **【实验操作】  USB线，插到开发板CMSIS-DAP接口上;
 **              因使用的是板载的LED，因而无需其它接线及器材;
 **              点击软件左上角的编译，编译无错后，点击LOAD，即可烧录至开发板;
 **
 **【划 重 点】  SysTick操作设置，一般用默认的就好，不用特意另行设置;
 **              
 **【更新记录】  2022-01-25  完善代码结构、注释
 **              2021-12-03  创建
 **
 **【备注说明】  版权归魔女科技所有，请勿商用，谢谢！ 
 **              https://demoboard.taobao.com 
====================================================================================================================*/
#include <stm32f10x.h>                               // 头文件引用(标准库); 内核、芯片外设....;(stm32f10x.conf.h, 对标准库头文件进行调用)     
#include "stm32f10x_conf.h"                          // 头文件引用(标准库); 内核、芯片外设....;(stm32f10x.conf.h, 对标准库头文件进行调用) 
#include "system_f103.h"                       
#include "bsp_led.h"                                 // LED代码文件



int main(void)                                       // 主函数, 整个工程的用户代码起始点
{   
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);  // 中断分组，组2:抢占级0~3,子优先级0~3 ; 全局只设置一次，尽量放在显眼的地方
    
    System_SysTickInit();                            // 初始化SysTick时钟
    
    Led_Init();                                      // LED初始化
    LED_BLUE_ON ;                                    // 点亮蓝灯
    LED_RED_ON;                                      // 点亮红灯  

    while(1)                                         // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    { 
        System_DelayMS (500);                        // 500ms延时
        LED_RED_ON;                                  // 红灯 亮
        LED_BLUE_OFF;                                // 蓝灯 灭
            
        System_DelayMS (500);                        // 500ms延时
        LED_RED_OFF;                                 // 红灯 灭
        LED_BLUE_ON;                                 // 蓝灯 亮           
    }          
}




