/**==================================================================================================================
 ** 【文件名称】  main.c
 **
 ** 【实现功能】  继电器控制
 **==================================================================================================================
 **
 ** 【适用平台】  STM32F103 + 标准库v3.5 + keil5
 **
 ** 【移植说明】  1- 复制工程文件夹下relay文件夹，到目标位置;
 **               2- 在目标工程中，引用bsp_relay.c文件，添加头文件路径;
 **               3- 在所需位置：#include "bsp_usb.h" ，即可调相关函数
 **
 **
 ** 【更新记录】  2022-06-00  
 **
 **
====================================================================================================================*/
#include <stm32f10x.h>            // 头文件引用(标准库); 内核、芯片外设....；(stm32f10x.conf.h, 对标准库头文件进行调用)     
#include "stm32f10x_conf.h"       // 头文件引用(标准库); 内核、芯片外设....；(stm32f10x.conf.h, 对标准库头文件进行调用) 
#include "bsp_led.h"              // LED指示灯
#include "bsp_key.h"
#include "bsp_usart.h"            // USART1、2、3，UART4、5
#include "bsp_relay.h"            // 继电器



// ms延时函数，减少移植时对外部文件依赖；
static void delay_ms(uint32_t ms)
{
    ms = ms * 10240;
    for (uint32_t i = 0; i < ms; i++); // 72MHz系统时钟下，多少个空循环约耗时1ms
}



// 主函数
int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);                // 中断分组，组2:抢占级0~3,子优先级0~3 ; 全局只设置一次，尽量放在显眼的地方
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);           // 使能AFIO辅助功能IO时钟
    AFIO->MAPR |= 0x2 << 24;                                       // 设置芯片调试方式(SWD): 000_全开, 010_只开SWD, 100:全关; 作用:关闭JTAG只保留SWD, 即释放PB3、PB4、PA15，只需PA13、PA14

    USART1_Init(115200);                                           // 串口初始化：USART1(115200-N-8-1), 且工程已把printf重定向至USART1输出; 特别注意：调用printf()前，必须先初始化其关联的USARTx,不然程序会卡死

    Led_Init();                                                    // LED 初始化; 板载LED的重要作用，配合代码调试，能方便地定位错误
    LED_RED_OFF;                                                   // 红灯，这里用作程序运行指示，
    LED_BLUE_OFF;                                                  // 蓝灯，这里用作USB连接指示：亮-连接成功，灭-未连接

    Key_Init();                                                    // 按键初始化

    Relay_1_Init();                                                // 初始化继电器所用引脚

    while (1)                                                      // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    {
        delay_ms(500);                                             // 延时
        LED_RED_ON;                                                // 红色LED，间隔亮灭，以判断系统正常工作
        Relay_1_ON();                                              // 打开第1路继电器

        delay_ms(500);                                             // 延时
        LED_RED_OFF;                                               // 红色LED，间隔亮灭，以判断系统正常工作
        Relay_1_OFF();                                             // 关闭第1路继电器
    }
}


