/*==================================================================================================================
 *【文件名称】  main.c
 *【功    能】  基本定时器
 ===================================================================================================================
 *【实验说明】
 *
 *【函数简介】  为简化及统一代码，已封装成方便调用的对外函数，可完成各种基本操作
 *              void TIM7_Init(uint16_t PSC, uint16_t ARR);    // 时钟分频值、自动重装载值
 *              void TIM7_Start();                             // 启动TIM7, 以TIM7_Init函数的配置开始工作
 *              void TIM7_Stop();                              // 停止工作，
 *
 *【更新记录】  2022-07-15  完善功能函数
 *              2022-05-16  创建
 *              2022-04-21  修改各文件名称、函数名称
 *
 *【备注说明】  版权归魔女科技所有，请勿商用，谢谢！
 *              https://demoboard.taobao.com
===================================================================================================================*/
#include <stm32f10x.h>
#include "stm32f10x_conf.h"                  // 头文件引用(标准库); 内核、芯片外设....；(stm32f10x.conf.h, 对标准库头文件进行调用)  
#include "bsp_led.h"                         // LED指示灯
#include "bsp_key.h"                         // 按键
#include "bsp_usart.h"                       // USART1、2、3，UART4、5
#include "bsp_tim.h"                         // TIM定时器支持文件




int main(void)
{
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);  // 设置中断组为2, 这个设置，放在了main()函数的第1行，以方便统一设置所有中断的分组

    USART1_Init(115200);                             // 初始化USART1作为调试信息输出

    Led_Init();                                      // LED 初始化
    LED_RED_ON ;
    LED_BLUE_ON ;

    TIM7_Init(72, 1000);                             // TIM6初始化，分频值:72, 重装载值：1000，即：每个脉冲0.0000001秒(1MHz: 72000000/7200), 每1000次脉冲产生一次中断(1000*0.000001=1ms);
    TIM7_Start();
    
    while (1)                                        // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    {
        if (xTIM.TIM7Counter >= 500)                 // 每500ms执行一次
        {
            LED_RED_TOGGLE;                          // 红色LED 每0.5秒闪灭一次，以监察系统正常工作
            LED_BLUE_TOGGLE;
            xTIM.TIM7Counter = 0;                    // 计数清0，以执行下一次计数
        }
    }
}






