/**==================================================================================================================
 **【文件名称】  main.c
 **【功能测试】  LED流水灯_延时函数的使用
 **==================================================================================================================
 **【实验平台】  STM32F103 + KEIL5.27 
 **
 **【实验操作】  USB线，插到开发板CMSIS-DAP接口上;
 **              因使用的是板载的LED，因而无需其它接线及器材;
 **              点击软件左上角的编译，编译无错后，点击LOAD，即可烧录至开发板;
 **
 **【划 重 点】  红色LED，已连接芯片的PC5引脚，至低电平可通路;
 **              蓝色LED，已连接芯片的PB2引脚，至低电平可通路;
 **              标准库，即库函数，必须包括在工程内，才能使用; 左侧工程文件管理器中FWLB文件夹，存放的就是标准库的支持文件;
 **              要使用库函数，必须在代码文件中引用相关的头文件，具体操作：在文件中引用stm32f10x_conf.h文件，并在其中取消相关文件的注释符号;
 **
 **【更新记录】  2022-01-25  完善代码结构、注释
 **              2021-12-03  创建
 **
 **【备注说明】  版权归魔女科技所有，请勿商用，谢谢！ 
 **              https://demoboard.taobao.com 
====================================================================================================================*/
#include <stm32f10x.h>               // 头文件引用(标准库); 内核、芯片外设....;(stm32f10x.conf.h, 对标准库头文件进行调用)     
#include "stm32f10x_conf.h"          // 头文件引用(标准库); 内核、芯片外设....;(stm32f10x.conf.h, 对标准库头文件进行调用) 
#include "bsp_led.h"                 // LED指示灯



static void delay_ms(uint32_t ms)    // 定义一个ms延时函数，减少移植时对外部文件依赖;
{
    ms=ms*6500;                  
    for(uint32_t i=0; i<ms; i++);    // 72MHz系统时钟下，大约6500个空循环耗时1ms
}



int main(void)                       // 主函数, 整个工程的用户代码起始点
{   
    Led_Init();                      // LED 初始化
    LED_BLUE_ON ;                    // 点亮蓝灯
    LED_RED_ON;                      // 点亮红灯          

    while(1)                         // while函数死循环，不能让main函数运行结束，否则会产生硬件错误
    { 
        delay_ms(500);               // 0.5秒延时
        LED_RED_ON;                  // 红灯 亮
        LED_BLUE_OFF;                // 蓝灯 灭
            
        delay_ms(500);               // 0.5秒延时
        LED_RED_OFF;                 // 红灯 灭
        LED_BLUE_ON;                 // 蓝灯 亮
    }          
}




